Revit 2027 API
ParameterTypeId.ColumnBaseAttachCutParam Property
 "Base Attachment Cut"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnBaseAttachCutParam { get; }
Public Shared ReadOnly Property ColumnBaseAttachCutParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnBaseAttachCutParam {
	ForgeTypeId^ get ();
}
static member ColumnBaseAttachCutParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace